packages/inductiva/inductiva-0.3.2.tar.gz/inductiva-0.3.2/inductiva/templates/wind_terrain/openfoam/files/system/blockMeshDict_template.openfoam.jinja
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( {{ terrain_bounds["x"][0] }}  {{ terrain_bounds["y"][0] }}   {{ terrain_bounds["z"][0] }})
    ( {{ terrain_bounds["x"][1] }}  {{ terrain_bounds["y"][0] }}    {{ terrain_bounds["z"][0] }})
    ( {{ terrain_bounds["x"][1] }}  {{ terrain_bounds["y"][1] }}    {{ terrain_bounds["z"][0] }})
    ( {{ terrain_bounds["x"][0] }}  {{ terrain_bounds["y"][1] }}   {{ terrain_bounds["z"][0] }})
    ( {{ terrain_bounds["x"][0] }}  {{ terrain_bounds["y"][0] }}    {{ top_boundary_height }})
    ( {{ terrain_bounds["x"][1] }}  {{ terrain_bounds["y"][0] }}    {{ top_boundary_height }})
    ( {{ terrain_bounds["x"][1] }}  {{ terrain_bounds["y"][1] }}   {{ top_boundary_height }})
    ( {{ terrain_bounds["x"][0] }}  {{ terrain_bounds["y"][1] }}   {{ top_boundary_height }})

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
